INSERT INTO ORDER_STATUS (STATUS_ID, NAME_STATUS)
	VALUES (1, 'Заказ принят'),
           (2, 'Заказ передан на исполнение'),
           (3, 'Заказ доставляется'),
           (4, 'Заказ подготовлен к выдаче'),
           (5, 'Заказ выдан'),
           (6, 'Изменение заказа, требуется подтверждение'),
           (7, 'Заказ не выдан клиенту, требуется уточнение'),
           (8, 'Заказ отменен клиентом'),
           (9, 'Заказ отменен. Истек срок хранения товара'),
           (10, 'Заказ отменен по техническим причинам');



INSERT INTO PRODUCT (DESCRIPTION, COST, QUANTITY,  CATEGORY)
	VALUES ('Телевизор', 12000, 15, 'Электроника'),
           ('Телефон', 35000, 11, 'Электроника'),
           ('Компьютер', 65000, 5, 'Электроника'),
           ('Шкаф', 8000, 6, 'Мебель'),
           ('Диван', 40000, 2, 'Мебель'),
           ('Кровать', 21000, 7, 'Мебель'),
           ('Дрель', 11500, 9, 'Инструменты'),
           ('Пила', 1500, 20, 'Инструменты'),
           ('Молоток', 500, 25, 'Инструменты'),
           ('Шахматы', 2300, 8, 'Настольные игры');



INSERT INTO CUSTOMER (FIRST_NAME, LAST_NAME, PHONE_NUMBER, EMAIL)
	VALUES ('Иван', 'Дмитриевич', '+7273408588', 'poppoigouddoma-6256@yopmail.com'),
           ('Петр', 'Алексеевич', '+7898340585', 'greppikovezo-4749@yopmail.com'),
           ('Людмила', 'Юрьевна', '+7274608553', 'lisoumoukezo-4804@yopmail.com'),
           ('Анатолий', 'Сергеевич', '+7950408544', 'zippouquaulleuhi-9875@yopmail.com'),
           ('Константин', 'Эдуардович', '+7563340742', 'peiveuvounnousoi-5042@yopmail.com'),
           ('Светлана', 'Александровна', '+7813857963', 'cajasseusefroi-1779@yopmail.com'),
           ('Евгений', 'Николаевич', '+7457982727', 'nofruxahacou-3589@yopmail.com'),
           ('Александр', 'Александрович', '+7882497141', 'coquoiselevo-1241@yopmail.com'),
           ('Юлия', 'Петровна', '+7412852637', 'meuffauddessike-5785@yopmail.com'),
           ('Дарья', 'Владимировна', '+7824244863', 'frauyazavoibrei-6251@yopmail.com');



INSERT INTO ORDERS (PRODUCT_ID, CUSTOMER_ID, ORDER_DATE,  QUANTITY, STATUS)
	VALUES (2, 1, '2025-09-01', 1, 1),
           (4, 5, '2025-09-05', 2, 5),
           (5, 9, '2025-09-06', 4, 2),
           (8, 8, '2025-09-01', 5, 10),
           (10, 6,'2025-09-09', 1, 8),
           (5, 3, '2025-09-10', 2, 3),
           (1, 7, '2025-09-4', 1, 5),
           (8, 5, '2025-09-3', 3, 4),
           (7, 3, '2025-09-4', 4, 8),
           (4, 4, '2025-09-2', 3, 2);